Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1025DAS176.atdf
         <register caption="CAN Receive FIFO Overflow Status Register" name="C1RXOVF" offset="0x60" rw="R" size="4">
            <bitfield caption="FIFOx Receive Overflow Interrupt Pending bit" mask="0xFFFFFFFF" name="RXOVF" values="C1RXOVF__RXOVF" />
         </register>
         <register caption="CAN Receive FIFO Overflow Status Register" name="C2RXOVF" offset="0x1060" rw="R" size="4">
            <bitfield caption="FIFOx Receive Overflow Interrupt Pending bit" mask="0xFFFFFFFF" name="RXOVF" values="C2RXOVF__RXOVF" />
         </register>
         <register caption="CAN Timer Register" name="C1TMR" offset="0x70" rw="RW" size="4">
            <bitfield caption="CAN Time Stamp Timer Prescaler bits" mask="0x0000FFFF" name="CANTSPRE" values="C1TMR__CANTSPRE" />
            <bitfield mask="0xFFFF0000" name="CANTS" />
         </register>
         <register caption="CAN Timer Register" name="C2TMR" offset="0x1070" rw="RW" size="4">
            <bitfield caption="CAN Time Stamp Timer Prescaler bits" mask="0x0000FFFF" name="CANTSPRE" values="C2TMR__CANTSPRE" />
            <bitfield mask="0xFFFF0000" name="CANTS" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C1RXM0" offset="0x80" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXM0__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C1RXM0__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXM0__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C2RXM0" offset="0x1080" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXM0__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C2RXM0__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXM0__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C1RXM1" offset="0x90" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXM1__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C1RXM1__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXM1__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C2RXM1" offset="0x10a0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXM1__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C2RXM1__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXM1__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C1RXM2" offset="0xa0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXM2__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C1RXM2__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXM2__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C2RXM2" offset="0x10b0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXM2__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C2RXM2__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXM2__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C1RXM3" offset="0xb0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXM3__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C1RXM3__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXM3__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C2RXM3" offset="0x10b0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXM3__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C2RXM3__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXM3__SID" />
         </register>
         <register caption="CAN Filter Control Register 0" name="C1FLTCON0" offset="0xc0" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL0" values="C1FLTCON0__FSEL0" />
            <bitfield caption="Filter 0 Mask Select bits" mask="0x00000060" name="MSEL0" values="C1FLTCON0__MSEL0" />
            <bitfield caption="Filter 0 Enable bit" mask="0x00000080" name="FLTEN0" values="C1FLTCON0__FLTEN0" />
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL1" values="C1FLTCON0__FSEL1" />
            <bitfield caption="Filter 1 Mask Select bits" mask="0x00006000" name="MSEL1" values="C1FLTCON0__MSEL1" />
            <bitfield caption="Filter 1 Enable bit" mask="0x00008000" name="FLTEN1" values="C1FLTCON0__FLTEN1" />
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL2" values="C1FLTCON0__FSEL2" />
            <bitfield caption="Filter 2 Mask Select bits" mask="0x00600000" name="MSEL2" values="C1FLTCON0__MSEL2" />
            <bitfield caption="Filter 2 Enable bit" mask="0x00800000" name="FLTEN2" values="C1FLTCON0__FLTEN2" />
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL3" values="C1FLTCON0__FSEL3" />
            <bitfield caption="Filter 3 Mask Select bits" mask="0x60000000" name="MSEL3" values="C1FLTCON0__MSEL3" />
            <bitfield caption="Filter 3 Enable bit" mask="0x80000000" name="FLTEN3" values="C1FLTCON0__FLTEN3" />
         </register>
