Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1025DAS176.atdf
      <value-group caption="Transmit FIFO Empty Interrupt Enable bit" name="C1FIFOINT18__TXEMPTYIE">
         <value caption="Interrupt enabled for FIFO empty" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Half Full Interrupt Enable bit" name="C1FIFOINT18__TXHALFIE">
         <value caption="Interrupt enabled for FIFO half full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO half full" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Not Full Interrupt Enable bit" name="C1FIFOINT18__TXNFULLIE">
         <value caption="Interrupt enabled for FIFO not full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO not full" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Not Empty Interrupt Flag bit(1)" name="C2FIFOINT18__RXNEMPTYIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) Unused, reads 0" name="" value="0x1" />
         <value caption="0: (FIFO configured as a Receive Buffer) 1 = FIFO is not empty, has at least 1 message, 0 = FIFO is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Half Full Interrupt Flag bit(1)" name="C2FIFOINT18__RXHALFIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) Unused, reads 0" name="" value="0x0" />
         <value caption="0: (FIFO configured as a Receive Buffer) 1 = FIFO is ? half full, 0 = FIFO is &lt; half full" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Full Interrupt Flag bit(1)" name="C2FIFOINT18__RXFULLIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) Unused, reads 0" name="" value="0x0" />
         <value caption="0: (FIFO configured as a Receive Buffer) 1 = FIFO is full, 0 = FIFO is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Overflow Interrupt Flag bit" name="C2FIFOINT18__RXOVFLIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) Unused, reads 0" name="" value="0x0" />
         <value caption="0: (FIFO configured as a Receive Buffer) 1 = Overflow event has occurred, 0 = No overflow event occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Empty Interrupt Flag bit(1)" name="C2FIFOINT18__TXEMPTYIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) 1 = FIFO is empty, 0 = FIFO is not empty, at least 1 message queued to be transmitted" name="" value="0x0" />
         <value caption="0: (FIFO configured as a Receive Buffer) Unused, reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit(1)" name="C2FIFOINT18__TXHALFIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) 1 = FIFO is ? half full, 0 = FIFO is &gt; half full" name="" value="0x0" />
         <value caption="0: (FIFO configured as a Receive Buffer) Unused, reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Not Full Interrupt Flag bit(1)" name="C2FIFOINT18__TXNFULLIF">
         <value caption="1: (FIFO configured as a Transmit Buffer) 1 = FIFO is not full, 0 = FIFO is full" name="" value="0x0" />
         <value caption="0: (FIFO configured as a Receive Buffer) Unused, reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Empty Interrupt Enable bit" name="C2FIFOINT18__RXNEMPTYIE">
         <value caption="Interrupt enabled for FIFO not empty" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO not empty" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Half Full Interrupt Enable bit" name="C2FIFOINT18__RXHALFIE">
         <value caption="Interrupt enabled for FIFO half full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO half full" name="" value="0x0" />
      </value-group>
      <value-group caption="Full Interrupt Enable bit" name="C2FIFOINT18__RXFULLIE">
         <value caption="Interrupt enabled for FIFO full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO full" name="" value="0x0" />
      </value-group>
      <value-group caption="Overflow Interrupt Enable bit" name="C2FIFOINT18__RXOVFLIE">
         <value caption="Interrupt enabled for overflow event" name="" value="0x1" />
         <value caption="Interrupt disabled for overflow event" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Empty Interrupt Enable bit" name="C2FIFOINT18__TXEMPTYIE">
         <value caption="Interrupt enabled for FIFO empty" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Half Full Interrupt Enable bit" name="C2FIFOINT18__TXHALFIE">
         <value caption="Interrupt enabled for FIFO half full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO half full" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Not Full Interrupt Enable bit" name="C2FIFOINT18__TXNFULLIE">
         <value caption="Interrupt enabled for FIFO not full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO not full" name="" value="0x0" />
      </value-group>
      <value-group caption="Message Transmit Priority bits" name="C1FIFOCON19__TXPRI">
         <value caption="Highest Message Priority" name="" value="0x3" />
         <value caption="High Intermediate Message Priority" name="" value="0x2" />
         <value caption="Low Intermediate Message Priority" name="" value="0x1" />
         <value caption="Lowest Message Priority" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto RTR Enable bit" name="C1FIFOCON19__RTREN">
         <value caption="When a remote transmit is received, TXREQ will be set" name="" value="0x1" />
         <value caption="When a remote transmit is received, TXREQ will be unaffected" name="" value="0x0" />
      </value-group>
      <value-group caption="Message Send Request" name="C1FIFOCON19__TXREQ">
         <value caption="1: (FIFO configured as a Transmit FIFO) Setting this bit to 1 requests sending a message. The bit will automatically clear when all the messages queued in the FIFO are successfully sent. Clearing the bit to 0 while set (1) will request a message abort." name="" value="0x0" />
         <value caption="0: (FIFO configured as a Receive FIFO) This bit has no effect." name="" value="0x0" />
      </value-group>
