Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1025DAS176.atdf
      <value-group caption="Power-on Reset Flag bit" name="RCON__POR">
         <value caption="Power-on Reset has occurred" name="" value="0x1" />
         <value caption="Power-on Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Brown-out Reset Flag bit" name="RCON__BOR">
         <value caption="Brown-out Reset has occurred" name="" value="0x1" />
         <value caption="Brown-out Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Idle Flag bit" name="RCON__IDLE">
         <value caption="Device was in Idle mode" name="" value="0x1" />
         <value caption="Device was not in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Sleep Flag bit" name="RCON__SLEEP">
         <value caption="Device was in Sleep mode" name="" value="0x1" />
         <value caption="Device was not in Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out Flag bit" name="RCON__WDTO">
         <value caption="WDT Time-out has occurred" name="" value="0x1" />
         <value caption="WDT Time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Deadman Timer Time-out Flag bit" name="RCON__DMTO">
         <value caption="A DMT time-out has occurred" name="" value="0x1" />
         <value caption="A DMT time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Flag bit" name="RCON__SWR">
         <value caption="Software Reset was executed" name="" value="0x1" />
         <value caption="Software Reset was not executed" name="" value="0x0" />
      </value-group>
      <value-group caption="External Reset (MCLR) Pin Flag bit" name="RCON__EXTR">
         <value caption="Master Clear (pin) Reset has occurred" name="" value="0x1" />
         <value caption="Master Clear (pin) Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Configuration Mismatch Reset Flag bit" name="RCON__CMR">
         <value caption="A Configuration Mismatch Reset has occurred" name="" value="0x1" />
         <value caption="A Configuration Mismatch Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Deep Sleep Mode Flag bit" name="RCON__DPSLP">
         <value caption="Deep Sleep mode has occurred" name="SLEEP" value="0x1" />
         <value caption="Deep Sleep mode has not occurred" name="NOSLEEP" value="0x0" />
      </value-group>
      <value-group caption="VBAT Mode Flag bit" name="RCON__VBAT">
         <value caption="A POR exit from VBAT has occurred" name="POR" value="0x1" />
         <value caption="A POR exit from VBAT has not occurred" name="NOPOR" value="0x0" />
      </value-group>
      <value-group caption="VBPOR Mode Flag bit" name="RCON__VBPOR">
         <value caption="A VBAT domain POR has occurred" name="POR" value="0x1" />
         <value caption="A VBAT domain POR has not occurred" name="NOPOR" value="0x0" />
      </value-group>
      <value-group caption="Primary/Secondary Configuration Registers Error Flag bit" name="RCON__BCFGFAIL">
         <value caption="An error occurred during a read of the primary and alternate configuration registers" name="" value="0x1" />
         <value caption="No error occurred during a read of the primary and alternate configuration registers" name="" value="0x0" />
      </value-group>
      <value-group caption="Primary Configuration Registers Error Flag bit" name="RCON__BCFGERR">
         <value caption="An error occurred during a read of the primary configuration registers" name="" value="0x1" />
         <value caption="No error occurred during a read of the primary configuration registers" name="" value="0x0" />
      </value-group>
      <value-group caption="VDDR1V8 (DDR2) High Voltage Detect Flag bit" name="RCON__HVD1V8R">
         <value caption="A high voltage condition on the VDDR1V8 voltage has occurred " name="" value="0x1" />
         <value caption="A high voltage condition on the VDDR1V8 voltage has not occurred " name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Trigger bit" name="RSWRST__SWRST">
         <value caption="Enable software Reset event" name="" value="0x1" />
         <value caption="No effect" name="" value="0x0" />
      </value-group>
      <value-group caption="NMI Reset Counter Value bits" name="RNMICON__NMICNT">
         <value caption="65535 SYSCLK cycles before a device Reset occurs" name="" value="0xffff" />
         <value caption="1 SYSCLK cycle before a device Reset occurs" name="" value="0x1" />
         <value caption="No delay between NMI assertion and device Reset event" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out in Sleep Mode Flag bit" name="RNMICON__WDTS">
         <value caption="WDT time-out has occurred during Sleep mode and caused a wake-up from sleep" name="" value="0x1" />
         <value caption="WDT time-out has not occurred during Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="RNMICON__CF">
         <value caption="FSCM has detected clock failure and caused an NMI" name="" value="0x1" />
         <value caption="FSCM has not detected clock failure" name="" value="0x0" />
      </value-group>
      <value-group caption="General NMI bit" name="RNMICON__GNMI">
         <value caption="A general NMI event has been detected or a user-initiated NMI event has occurred" name="" value="0x1" />
         <value caption="A general NMI event has not been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Software NMI Trigger" name="RNMICON__SWNMI">
         <value caption="An NMI will be generated" name="" value="0x1" />
         <value caption="An NMI will not be generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-Out Flag bit" name="RNMICON__WDTO">
         <value caption="WDT time-out has occurred and caused a NMI" name="" value="0x1" />
         <value caption="WDT time-out has not occurred" name="" value="0x0" />
      </value-group>
