Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1025DAS176.atdf
      <value-group caption="Channel Cell Transfer Complete Interrupt Enable bit" name="DCH7INT__CHCCIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Block Transfer Complete Interrupt Enable bit" name="DCH7INT__CHBCIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Half Full Interrupt Enable bit" name="DCH7INT__CHDHIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Done Interrupt Enable bit" name="DCH7INT__CHDDIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Half Empty Interrupt Enable bit" name="DCH7INT__CHSHIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Done Interrupt Enable bit" name="DCH7INT__CHSDIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH0SSIZ__CHSSIZ">
         <value caption="2 byte source size" name="" value="0x2" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH1SSIZ__CHSSIZ">
         <value caption="2 byte source size" name="" value="0x2" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH2SSIZ__CHSSIZ">
         <value caption="2 byte source size" name="" value="0x2" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH3SSIZ__CHSSIZ">
         <value caption="2 byte source size" name="" value="0x2" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH4SSIZ__CHSSIZ">
         <value caption="2 byte source size" name="" value="0x2" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH5SSIZ__CHSSIZ">
         <value caption="2 byte source size" name="" value="0x2" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH6SSIZ__CHSSIZ">
         <value caption="2 byte source size" name="" value="0x2" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH7SSIZ__CHSSIZ">
         <value caption="2 byte source size" name="" value="0x2" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH0DSIZ__CHDSIZ">
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH1DSIZ__CHDSIZ">
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH2DSIZ__CHDSIZ">
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH3DSIZ__CHDSIZ">
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH4DSIZ__CHDSIZ">
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH5DSIZ__CHDSIZ">
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH6DSIZ__CHDSIZ">
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH7DSIZ__CHDSIZ">
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Pointer bits" name="DCH0SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff" />
         <value caption="Points to byte 1 of the source" name="" value="0x1" />
         <value caption="Points to byte 0 of the source" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Pointer bits" name="DCH1SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff" />
         <value caption="Points to byte 1 of the source" name="" value="0x1" />
         <value caption="Points to byte 0 of the source" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Pointer bits" name="DCH2SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff" />
         <value caption="Points to byte 1 of the source" name="" value="0x1" />
         <value caption="Points to byte 0 of the source" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Pointer bits" name="DCH3SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff" />
         <value caption="Points to byte 1 of the source" name="" value="0x1" />
         <value caption="Points to byte 0 of the source" name="" value="0x0" />
      </value-group>
