Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1025DAS176.atdf
         <register caption="" name="GLCDCLUT244" offset="0x7D0" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT245" offset="0x7D4" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT246" offset="0x7D8" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT247" offset="0x7DC" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT248" offset="0x7E0" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT249" offset="0x7E4" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT250" offset="0x7E8" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT251" offset="0x7EC" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT252" offset="0x7F0" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT253" offset="0x7F4" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT254" offset="0x7F8" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCLUT255" offset="0x7FC" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BLUE" />
            <bitfield mask="0x0000FF00" name="GREEN" />
            <bitfield mask="0x00FF0000" name="RED" />
         </register>
         <register caption="" name="GLCDCURDATA0" offset="0x800" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL07" />
            <bitfield mask="0x000000F0" name="PIXEL06" />
            <bitfield mask="0x00000F00" name="PIXEL05" />
            <bitfield mask="0x0000F000" name="PIXEL04" />
            <bitfield mask="0x000F0000" name="PIXEL03" />
            <bitfield mask="0x00F00000" name="PIXEL02" />
            <bitfield mask="0x0F000000" name="PIXEL01" />
            <bitfield mask="0xF0000000" name="PIXEL00" />
         </register>
         <register caption="" name="GLCDCURDATA1" offset="0x804" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL015" />
            <bitfield mask="0x000000F0" name="PIXEL014" />
            <bitfield mask="0x00000F00" name="PIXEL013" />
            <bitfield mask="0x0000F000" name="PIXEL012" />
            <bitfield mask="0x000F0000" name="PIXEL011" />
            <bitfield mask="0x00F00000" name="PIXEL010" />
            <bitfield mask="0x0F000000" name="PIXEL09" />
            <bitfield mask="0xF0000000" name="PIXEL08" />
         </register>
         <register caption="" name="GLCDCURDATA2" offset="0x808" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL023" />
            <bitfield mask="0x000000F0" name="PIXEL022" />
            <bitfield mask="0x00000F00" name="PIXEL021" />
            <bitfield mask="0x0000F000" name="PIXEL020" />
            <bitfield mask="0x000F0000" name="PIXEL019" />
            <bitfield mask="0x00F00000" name="PIXEL018" />
            <bitfield mask="0x0F000000" name="PIXEL017" />
            <bitfield mask="0xF0000000" name="PIXEL016" />
         </register>
         <register caption="" name="GLCDCURDATA3" offset="0x80C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL031" />
            <bitfield mask="0x000000F0" name="PIXEL030" />
            <bitfield mask="0x00000F00" name="PIXEL029" />
            <bitfield mask="0x0000F000" name="PIXEL028" />
            <bitfield mask="0x000F0000" name="PIXEL027" />
            <bitfield mask="0x00F00000" name="PIXEL026" />
            <bitfield mask="0x0F000000" name="PIXEL025" />
            <bitfield mask="0xF0000000" name="PIXEL024" />
         </register>
         <register caption="" name="GLCDCURDATA4" offset="0x810" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL17" />
            <bitfield mask="0x000000F0" name="PIXEL16" />
            <bitfield mask="0x00000F00" name="PIXEL15" />
            <bitfield mask="0x0000F000" name="PIXEL14" />
            <bitfield mask="0x000F0000" name="PIXEL13" />
            <bitfield mask="0x00F00000" name="PIXEL12" />
            <bitfield mask="0x0F000000" name="PIXEL11" />
            <bitfield mask="0xF0000000" name="PIXEL10" />
         </register>
