Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1025DAS176.atdf
         <register caption="" name="IPC5" offset="0x190" rw="RW" size="4">
            <bitfield mask="0x00000003" name="IC4EIS" />
            <bitfield mask="0x0000001C" name="IC4EIP" />
            <bitfield mask="0x00000300" name="IC4IS" />
            <bitfield mask="0x00001C00" name="IC4IP" />
            <bitfield mask="0x00030000" name="OC4IS" />
            <bitfield mask="0x001C0000" name="OC4IP" />
            <bitfield mask="0x03000000" name="INT4IS" />
            <bitfield mask="0x1C000000" name="INT4IP" />
         </register>
         <register caption="" name="IPC6" offset="0x1a0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T5IS" />
            <bitfield mask="0x0000001C" name="T5IP" />
            <bitfield mask="0x00000300" name="IC5EIS" />
            <bitfield mask="0x00001C00" name="IC5EIP" />
            <bitfield mask="0x00030000" name="IC5IS" />
            <bitfield mask="0x001C0000" name="IC5IP" />
            <bitfield mask="0x03000000" name="OC5IS" />
            <bitfield mask="0x1C000000" name="OC5IP" />
         </register>
         <register caption="" name="IPC7" offset="0x1b0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T6IS" />
            <bitfield mask="0x0000001C" name="T6IP" />
            <bitfield mask="0x00000300" name="IC6EIS" />
            <bitfield mask="0x00001C00" name="IC6EIP" />
            <bitfield mask="0x00030000" name="IC6IS" />
            <bitfield mask="0x001C0000" name="IC6IP" />
            <bitfield mask="0x03000000" name="OC6IS" />
            <bitfield mask="0x1C000000" name="OC6IP" />
         </register>
         <register caption="" name="IPC8" offset="0x1c0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T7IS" />
            <bitfield mask="0x0000001C" name="T7IP" />
            <bitfield mask="0x00000300" name="IC7EIS" />
            <bitfield mask="0x00001C00" name="IC7EIP" />
            <bitfield mask="0x00030000" name="IC7IS" />
            <bitfield mask="0x001C0000" name="IC7IP" />
            <bitfield mask="0x03000000" name="OC7IS" />
            <bitfield mask="0x1C000000" name="OC7IP" />
         </register>
         <register caption="" name="IPC9" offset="0x1d0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T8IS" />
            <bitfield mask="0x0000001C" name="T8IP" />
            <bitfield mask="0x00000300" name="IC8EIS" />
            <bitfield mask="0x00001C00" name="IC8EIP" />
            <bitfield mask="0x00030000" name="IC8IS" />
            <bitfield mask="0x001C0000" name="IC8IP" />
            <bitfield mask="0x03000000" name="OC8IS" />
            <bitfield mask="0x1C000000" name="OC8IP" />
         </register>
         <register caption="" name="IPC10" offset="0x1e0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T9IS" />
            <bitfield mask="0x0000001C" name="T9IP" />
            <bitfield mask="0x00000300" name="IC9EIS" />
            <bitfield mask="0x00001C00" name="IC9EIP" />
            <bitfield mask="0x00030000" name="IC9IS" />
            <bitfield mask="0x001C0000" name="IC9IP" />
            <bitfield mask="0x03000000" name="OC9IS" />
            <bitfield mask="0x1C000000" name="OC9IP" />
         </register>
         <register caption="" name="IPC11" offset="0x1f0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCIS" />
            <bitfield mask="0x0000001C" name="ADCIP" />
            <bitfield mask="0x00000300" name="ADCFIFOIS" />
            <bitfield mask="0x00001C00" name="ADCFIFOIP" />
            <bitfield mask="0x00030000" name="ADCDC1IS" />
            <bitfield mask="0x001C0000" name="ADCDC1IP" />
            <bitfield mask="0x03000000" name="ADCDC2IS" />
            <bitfield mask="0x1C000000" name="ADCDC2IP" />
         </register>
         <register caption="" name="IPC12" offset="0x200" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCDC3IS" />
            <bitfield mask="0x0000001C" name="ADCDC3IP" />
            <bitfield mask="0x00000300" name="ADCDC4IS" />
            <bitfield mask="0x00001C00" name="ADCDC4IP" />
            <bitfield mask="0x00030000" name="ADCDC5IS" />
            <bitfield mask="0x001C0000" name="ADCDC5IP" />
            <bitfield mask="0x03000000" name="ADCDC6IS" />
            <bitfield mask="0x1C000000" name="ADCDC6IP" />
         </register>
         <register caption="" name="IPC13" offset="0x210" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCDF1IS" />
            <bitfield mask="0x0000001C" name="ADCDF1IP" />
            <bitfield mask="0x00000300" name="ADCDF2IS" />
            <bitfield mask="0x00001C00" name="ADCDF2IP" />
            <bitfield mask="0x00030000" name="ADCDF3IS" />
            <bitfield mask="0x001C0000" name="ADCDF3IP" />
            <bitfield mask="0x03000000" name="ADCDF4IS" />
            <bitfield mask="0x1C000000" name="ADCDF4IP" />
         </register>
         <register caption="" name="IPC14" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCDF5IS" />
            <bitfield mask="0x0000001C" name="ADCDF5IP" />
            <bitfield mask="0x00000300" name="ADCDF6IS" />
            <bitfield mask="0x00001C00" name="ADCDF6IP" />
            <bitfield mask="0x00030000" name="ADCFLTIS" />
            <bitfield mask="0x001C0000" name="ADCFLTIP" />
            <bitfield mask="0x03000000" name="ADCD0IS" />
            <bitfield mask="0x1C000000" name="ADCD0IP" />
         </register>
         <register caption="" name="IPC15" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD1IS" />
            <bitfield mask="0x0000001C" name="ADCD1IP" />
            <bitfield mask="0x00000300" name="ADCD2IS" />
            <bitfield mask="0x00001C00" name="ADCD2IP" />
            <bitfield mask="0x00030000" name="ADCD3IS" />
            <bitfield mask="0x001C0000" name="ADCD3IP" />
            <bitfield mask="0x03000000" name="ADCD4IS" />
            <bitfield mask="0x1C000000" name="ADCD4IP" />
         </register>
         <register caption="" name="IPC16" offset="0x240" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD5IS" />
            <bitfield mask="0x0000001C" name="ADCD5IP" />
            <bitfield mask="0x00000300" name="ADCD6IS" />
            <bitfield mask="0x00001C00" name="ADCD6IP" />
            <bitfield mask="0x00030000" name="ADCD7IS" />
            <bitfield mask="0x001C0000" name="ADCD7IP" />
            <bitfield mask="0x03000000" name="ADCD8IS" />
            <bitfield mask="0x1C000000" name="ADCD8IP" />
         </register>
